# ==================== Taps ====================
tap "homebrew/bundle"

# ==================== CLI Tools ====================
brew "chezmoi"
brew "fzf"
brew "git-lfs"
brew "tree"
brew "wget"
brew "vim"
brew "watch"
brew "telnet"
brew "ipcalc"

# Shell
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Cloud & Infra
brew "aliyun-cli"
brew "ansible"
brew "docker"
brew "docker-completion"
brew "kubernetes-cli"
brew "helm"
brew "helm-ls"
brew "kubectx"
brew "kubecm"

# Database
brew "mongosh"
brew "mysql-client"

# Languages
brew "go"
brew "node"
brew "python@3.13"

# ==================== GUI Apps ====================
cask "ghostty"
cask "orbstack"

# ==================== Fonts ====================
cask "font-hack-nerd-font"
cask "font-ubuntu-mono-nerd-font"
